a = str(input("Роль первого туриста:"))
b = str(input("Роль второго туриста:"))
c = str(input("Роль третьего туриста:"))
x = 0

if a == 'Член профсоюза':
    x = x + 10
elif a == 'Ребенок':
    x = x + 5
elif a == 'Не член профсоюза':
    x = x + 30
elif a == 'Милиционер':
    x = x + 5

if b == 'Член профсоюза':
    x = x + 10
elif b == 'Ребенок':
    x = x + 5
elif b == 'Не член профсоюза':
    x = x + 30
elif b == 'Милиционер':
    x = x + 5

if c == 'Член профсоюза':
    x = x + 10
elif c == 'Ребенок':
    x = x + 5
elif c == 'Не член профсоюза':
    x = x + 30
elif c == 'Милиционер':
    x = x + 5
print(x)